#Область СлужебныйПрограммныйИнтерфейс
 
Процедура ИсполняемыеСценарии() Экспорт
     
    ЮТТесты.ДобавитьТестовыйНабор("Тесты документа Оплата").ВТранзакции()
    	.ДобавитьТест("ПроверкаПроведенияДокументовОплата", "", "Позитив")
		;
 
КонецПроцедуры  
	
 
Процедура ПроверкаПроведенияДокументовОплата() Экспорт
 	
 	// Создание данных НСИ     
	СтруктураНСИ = ОМ_ГенерацияТестовыхДанных.СгенерироватьНСИ();
	КонтрагентНовый = СтруктураНСИ.Контрагент;
	ОрганизацияНовая = СтруктураНСИ.Организация;
	ВалютаНовая = СтруктураНСИ.Валюта;
	РасчетныйСчетНовый = СтруктураНСИ.РасчетыйСчет;
	РасчетныйСчетПоставщикаНовый = СтруктураНСИ.РасчетыйСчетКонтрагента;
	
	СтруктураФиксированныхДанных = ОМ_ГенерацияТестовыхДанных.ФиксированныеДанныеДокументов();
	
	Сумма = СтруктураФиксированныхДанных.Сумма;    
	
 	// Создание прихода
	Для Сч = 1 По 3 Цикл
		Оплата = ОМ_ГенерацияТестовыхДанных.СозданиеОплаты(ОрганизацияНовая, РасчетныйСчетНовый, РасчетныйСчетПоставщикаНовый, Сумма, КонтрагентНовый, ВалютаНовая);  
					
		ЮТест.ОжидаетЧто(Оплата.Проведен)
			.ЭтоИстина("Документ должен быть проведен")
			;                                           
					
	КонецЦикла; 	
 		
КонецПроцедуры   			
 
#КонецОбласти  