#Область СлужебныйПрограммныйИнтерфейс
 
Процедура ИсполняемыеСценарии() Экспорт
     
    ЮТТесты.ДобавитьТестовыйНабор("Контроль остатков по взаиморасчетам").ВТранзакции()
    	.ДобавитьТест("ПроверкаВыводаВзаиморасчетовВНольПозитив", "", "Позитив")
		.ДобавитьТест("ПроверкаВыводаВзаиморасчетовВНольНегатив", "", "Негатив")
		;
 
КонецПроцедуры  
	
 
Процедура ПроверкаВыводаВзаиморасчетовВНольПозитив() Экспорт
 	
 	// Создание данных НСИ     
	СтруктураНСИ = ОМ_ГенерацияТестовыхДанных.СгенерироватьНСИ();
	ТоварНовый = СтруктураНСИ.Товар;
	КонтрагентНовый = СтруктураНСИ.Контрагент;
	СкладНовый = СтруктураНСИ.Склад;
	ВалютаНовая = СтруктураНСИ.Валюта;  
	
	СтруктураФиксированныхДанных = ОМ_ГенерацияТестовыхДанных.ФиксированныеДанныеДокументов();
	
	Цена = СтруктураФиксированныхДанных.Цена;
	Количество = СтруктураФиксированныхДанных.Количество;
	Сумма = СтруктураФиксированныхДанных.Сумма;    
	КоличествоРасхода = СтруктураФиксированныхДанных.КоличествоРасхода;
	СуммаРасхода = СтруктураФиксированныхДанных.СуммаРасхода;
	
 	// Создание прихода
	Для Сч = 1 По 3 Цикл
		ПриходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеПрихода(СкладНовый, ТоварНовый, Цена, Сумма, Количество, КонтрагентНовый, ВалютаНовая);                                         		
	КонецЦикла; 
	
	РасходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеРасхода(СкладНовый, ТоварНовый, Цена, СуммаРасхода, КоличествоРасхода, КонтрагентНовый, ВалютаНовая);
	
	ОстатокВзаиморасчетов = ОМ_ГенерацияТестовыхДанных.ПолучитьОстатокВзаиморасчетов(КонтрагентНовый, ВалютаНовая);
	
	ЮТест.ОжидаетЧто(ОстатокВзаиморасчетов) 
		.Равно(0, "Проверка на равенство ожидаемому значению 0")
		; 	
 		
КонецПроцедуры
	
Процедура ПроверкаВыводаВзаиморасчетовВНольНегатив() Экспорт
 	
 	// Создание данных НСИ     
	СтруктураНСИ = ОМ_ГенерацияТестовыхДанных.СгенерироватьНСИ();
	ТоварНовый = СтруктураНСИ.Товар;
	КонтрагентНовый = СтруктураНСИ.Контрагент;
	СкладНовый = СтруктураНСИ.Склад;
	ВалютаНовая = СтруктураНСИ.Валюта;  
	
	СтруктураФиксированныхДанных = ОМ_ГенерацияТестовыхДанных.ФиксированныеДанныеДокументов();
	
	Цена = СтруктураФиксированныхДанных.Цена;
	Количество = СтруктураФиксированныхДанных.Количество;
	Сумма = СтруктураФиксированныхДанных.Сумма;    
	КоличествоРасхода = СтруктураФиксированныхДанных.КоличествоРасхода;
	СуммаРасхода = СтруктураФиксированныхДанных.СуммаРасходаНегатив;
	
 	// Создание прихода
	Для Сч = 1 По 3 Цикл
		ПриходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеПрихода(СкладНовый, ТоварНовый, Цена, Сумма, Количество, КонтрагентНовый, ВалютаНовая);                                         		
	КонецЦикла; 
	
	РасходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеРасхода(СкладНовый, ТоварНовый, Цена, СуммаРасхода, КоличествоРасхода, КонтрагентНовый, ВалютаНовая);
	
	ОстатокВзаиморасчетов = ОМ_ГенерацияТестовыхДанных.ПолучитьОстатокВзаиморасчетов(КонтрагентНовый, ВалютаНовая);
	
	ЮТест.ОжидаетЧто(ОстатокВзаиморасчетов) 
		.НеРавно(0, "Проверка на равенство ожидаемому значению 0")
		; 	
 		
КонецПроцедуры  	
 
#КонецОбласти  