#Область СлужебныйПрограммныйИнтерфейс
 
Процедура ИсполняемыеСценарии() Экспорт
     
    ЮТТесты.ДобавитьТестовыйНабор("Тесты документа Расход товара").ВТранзакции()
    	.ДобавитьТест("ПроверкаПроведенияДокументовРасход", "", "Позитив")
		.ДобавитьТест("ПроверкаДвиженийРасходаПоВзаиморасчетам", "", "Позитив")
		.ДобавитьТест("ПроверкаДвиженийРасходаПоТоварнымЗапасам", "", "Позитив")
		;
 
КонецПроцедуры  
	
 
Процедура ПроверкаПроведенияДокументовРасход() Экспорт
 	
 	// Создание данных НСИ     
	СтруктураНСИ = ОМ_ГенерацияТестовыхДанных.СгенерироватьНСИ();
	ТоварНовый = СтруктураНСИ.Товар;
	КонтрагентНовый = СтруктураНСИ.Контрагент;
	СкладНовый = СтруктураНСИ.Склад;
	ВалютаНовая = СтруктураНСИ.Валюта;  
	
	СтруктураФиксированныхДанных = ОМ_ГенерацияТестовыхДанных.ФиксированныеДанныеДокументов();
	
	Цена = СтруктураФиксированныхДанных.Цена;
	Количество = СтруктураФиксированныхДанных.Количество;
	Сумма = СтруктураФиксированныхДанных.Сумма;    
	КоличествоРасхода = СтруктураФиксированныхДанных.КоличествоРасхода;
	СуммаРасхода = СтруктураФиксированныхДанных.СуммаРасхода;
	
 	// Создание прихода
	Для Сч = 1 По 3 Цикл
		ПриходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеПрихода(СкладНовый, ТоварНовый, Цена, Сумма, Количество, КонтрагентНовый, ВалютаНовая);                                         		
	КонецЦикла; 
	
	РасходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеРасхода(СкладНовый, ТоварНовый, Цена, СуммаРасхода, КоличествоРасхода, КонтрагентНовый, ВалютаНовая);
	
	ЮТест.ОжидаетЧто(РасходТовара.Проведен)
		.ЭтоИстина("Документ должен быть проведен")
		; 
 		
КонецПроцедуры   
	
Процедура ПроверкаДвиженийРасходаПоВзаиморасчетам() Экспорт
 	
 	// Создание данных НСИ     
	СтруктураНСИ = ОМ_ГенерацияТестовыхДанных.СгенерироватьНСИ();
	ТоварНовый = СтруктураНСИ.Товар;
	КонтрагентНовый = СтруктураНСИ.Контрагент;
	СкладНовый = СтруктураНСИ.Склад;
	ВалютаНовая = СтруктураНСИ.Валюта; 
	
	СтруктураФиксированныхДанных = ОМ_ГенерацияТестовыхДанных.ФиксированныеДанныеДокументов();
	Цена = СтруктураФиксированныхДанных.Цена;
	Количество = СтруктураФиксированныхДанных.Количество;
	Сумма = СтруктураФиксированныхДанных.Сумма;    
	КоличествоРасхода = СтруктураФиксированныхДанных.КоличествоРасхода;
	СуммаРасхода = СтруктураФиксированныхДанных.СуммаРасхода;
	
 	// Создание прихода
	Для Сч = 1 По 3 Цикл
		ПриходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеПрихода(СкладНовый, ТоварНовый, Цена, Сумма, Количество, КонтрагентНовый, ВалютаНовая);  								
	КонецЦикла; 
		
	РасходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеРасхода(СкладНовый, ТоварНовый, Цена, СуммаРасхода, КоличествоРасхода, КонтрагентНовый, ВалютаНовая);	
	
	ЮТест.ОжидаетЧто(ЮТЗапросы.ДвиженияДокумента(РасходТовара.Ссылка, "Взаиморасчеты"))
			.НеИмеетДлину(0, "Проверка на неравенство ожидаемому значению 0")
			;
		 		
КонецПроцедуры   

Процедура ПроверкаДвиженийРасходаПоТоварнымЗапасам() Экспорт
 	
 	// Создание данных НСИ     
	СтруктураНСИ = ОМ_ГенерацияТестовыхДанных.СгенерироватьНСИ();
	ТоварНовый = СтруктураНСИ.Товар;
	КонтрагентНовый = СтруктураНСИ.Контрагент;
	СкладНовый = СтруктураНСИ.Склад;
	ВалютаНовая = СтруктураНСИ.Валюта; 
	
	СтруктураФиксированныхДанных = ОМ_ГенерацияТестовыхДанных.ФиксированныеДанныеДокументов();
	Цена = СтруктураФиксированныхДанных.Цена;
	Количество = СтруктураФиксированныхДанных.Количество;
	Сумма = СтруктураФиксированныхДанных.Сумма;    
	КоличествоРасхода = СтруктураФиксированныхДанных.КоличествоРасхода;
	СуммаРасхода = СтруктураФиксированныхДанных.СуммаРасхода;
	
 	// Создание прихода
	Для Сч = 1 По 3 Цикл
		ПриходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеПрихода(СкладНовый, ТоварНовый, Цена, Сумма, Количество, КонтрагентНовый, ВалютаНовая);  								
	КонецЦикла; 
		
	РасходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеРасхода(СкладНовый, ТоварНовый, Цена, СуммаРасхода, КоличествоРасхода, КонтрагентНовый, ВалютаНовая);	
	
	ЮТест.ОжидаетЧто(ЮТЗапросы.ДвиженияДокумента(РасходТовара.Ссылка, "ТоварныеЗапасы"))
			.НеИмеетДлину(0, "Проверка на неравенство ожидаемому значению 0")
			;		
		 		
КонецПроцедуры  
			
 
#КонецОбласти  