
Функция СведенияОВнешнейОбработке() Экспорт  
	
	ПарамРег = Новый Структура();
	ПарамРег.Вставить("Наименование", "Списание остатков партий НДС (МВС ИИ)");
	ПарамРег.Вставить("БезопасныйРежим", Истина);
	ПарамРег.Вставить("Версия ", "1.0.0");
	ПарамРег.Вставить("Информация", "Списание остатков партий НДС (МВС ИИ)");
	ПарамРег.Вставить("Вид", "ДополнительнаяОбработка"); 
	ПарамРег.БезопасныйРежим 	= Ложь;
	
	ТЗ_Команды = Новый ТаблицаЗначений;
	ТЗ_Команды.Колонки.Добавить("Идентификатор");
	ТЗ_Команды.Колонки.Добавить("Использование");
	ТЗ_Команды.Колонки.Добавить("Представление");
	
	НоваяСтрока = ТЗ_Команды.Добавить();
	НоваяСтрока.Идентификатор = "ОткрытьОбработку";
	НоваяСтрока.Использование = "ОткрытиеФормы";
	НоваяСтрока.Представление = "Списание остатков партий НДС (МВС ИИ)";
	ПарамРег.Вставить("Команды", ТЗ_Команды);
	
	Возврат ПарамРег;
	
КонецФункции