#Область СлужебныеПроцедурыИФункции

Функция СгенерироватьНСИ() Экспорт  
	
	СтруктураНСИ = Новый Структура("Товар, Склад, Контрагент, Валюта, Организация, РасчетыйСчет, РасчетыйСчетКонтрагента");
	
	СтруктураНСИ.Товар = СозданиеТовара("Тест_Хлеб");
	СтруктураНСИ.Склад = СозданиеСправочника("Тест_Склад", "Склады");   
	СтруктураНСИ.Контрагент = СозданиеСправочника("Тест_Контрагент", "Контрагенты");
	СтруктураНСИ.Валюта = СозданиеСправочника("Тест_Валюта", "Валюты");
	СтруктураНСИ.Организация = СозданиеСправочника("Тест_Организация", "Организации");
	СтруктураНСИ.РасчетыйСчет = СозданиеРасчетногоСчета("Тест_РасчетыйСчет", "РасчетныеСчета", СтруктураНСИ.Организация);
	СтруктураНСИ.РасчетыйСчетКонтрагента = СозданиеРасчетногоСчета("Тест_РасчетыйСчетКонтрагента", "РасчетныеСчетаКонтрагентов", СтруктураНСИ.Контрагент);
	
	Возврат СтруктураНСИ;
	
КонецФункции	  			 

Функция ПолучитьОстатокВзаиморасчетов(КонтрагентНовый, ВалютаНовая) Экспорт   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыОстатки.Контрагент КАК Контрагент,
	               |	ВзаиморасчетыОстатки.Валюта КАК Валюта,
	               |	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.Взаиморасчеты.Остатки(
	               |			&ДатаСреза,
	               |			Валюта = &Валюта
	               |				И Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки"; 
	Запрос.УстановитьПараметр("Контрагент", КонтрагентНовый);
	Запрос.УстановитьПараметр("Валюта", ВалютаНовая);  
	Запрос.УстановитьПараметр("ДатаСреза", Новый Граница(ТекущаяДатаСеанса(), ВидГраницы.Включая));
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.СуммаОстаток;
		КонецЕсли;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции 

Функция ПолучитьОстатокТоваров(ТоварНовый, СкладНовый) Экспорт   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварныеЗапасыОстатки.Товар КАК Товар,
	               |	ТоварныеЗапасыОстатки.Склад КАК Склад,
	               |	ТоварныеЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварныеЗапасы.Остатки(
	               |			&ДатаСреза,
	               |			Склад = &Склад
	               |				И Товар = &Товар) КАК ТоварныеЗапасыОстатки"; 
	Запрос.УстановитьПараметр("Товар", ТоварНовый);
	Запрос.УстановитьПараметр("Склад", СкладНовый);  
	Запрос.УстановитьПараметр("ДатаСреза", Новый Граница(ТекущаяДатаСеанса(), ВидГраницы.Включая));
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.КоличествоОстаток;
		КонецЕсли;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция СозданиеПрихода(Склад, Товар, Цена, Сумма, Количество, КонтрагентНовый, ВалютаНовая) Экспорт   
	
	ПриходТовара = ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Склад", Склад) 
		.Установить("Поставщик", КонтрагентНовый)
		.Установить("Валюта", ВалютаНовая)
		.ФикцияРеквизитов("Организация")
		.ТабличнаяЧасть("Товары").ДобавитьСтроку()
			.Установить("Товар", Товар)
			.Установить("Цена", Цена)
			.Установить("Количество", Количество)
			.Установить("Сумма", Сумма)
		.Провести(Истина)
		;
		
	Возврат ПриходТовара;	
	
КонецФункции  

Функция СозданиеОплаты(Организация, РасчетныйСчет, РасчетныйСчетПоставщика, Сумма, Поставщик, Валюта) Экспорт
	
	Оплата = ЮТест.Данные().КонструкторОбъекта("Документы.Оплата")
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Организация", Организация) 
		.Установить("Поставщик", Поставщик)
		.Установить("Валюта", Валюта)
		.Установить("РасчетныйСчет", РасчетныйСчет)
		.Установить("РасчетныйСчетПоставщика", РасчетныйСчетПоставщика) 
		.Установить("Сумма", Сумма)
		.Провести(Истина)
		;
		
	Возврат Оплата;	
	
КонецФункции

Функция СозданиеПоступленияДенег(Организация, РасчетныйСчет, РасчетныйСчетПокупателя, Сумма, Покупатель, Валюта) Экспорт
	
	ПоступлениеДенег = ЮТест.Данные().КонструкторОбъекта("Документы.ПоступлениеДенег")
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Организация", Организация) 
		.Установить("Покупатель", Покупатель)
		.Установить("Валюта", Валюта)
		.Установить("РасчетныйСчет", РасчетныйСчет)
		.Установить("РасчетныйСчетПокупателя", РасчетныйСчетПокупателя) 
		.Установить("Сумма", Сумма)
		.Провести(Истина)
		;
		
	Возврат ПоступлениеДенег;	
	
КонецФункции 

Функция СозданиеРасхода(Склад, Товар, Цена, Сумма, Количество, КонтрагентНовый, ВалютаНовая) Экспорт      
		
	РасходТовара = ЮТест.Данные().КонструкторОбъекта("Документы.РасходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Склад", Склад) 
		.Установить("Покупатель", КонтрагентНовый)
		.Установить("Валюта", ВалютаНовая)
		.ФикцияРеквизитов("Организация")
		.ТабличнаяЧасть("Товары").ДобавитьСтроку()
			.Установить("Товар", Товар)
			.Установить("Цена", Цена)
			.Установить("Количество", Количество)
			.Установить("Сумма", Сумма)
		.Провести(Истина)
		;	
		
	Возврат РасходТовара;	
	
КонецФункции
 
Функция СозданиеТовара(Наименование)
	
	КонструкторТовара = ЮТест.Данные().КонструкторОбъекта("Справочники.Товары")
		.ФикцияОбязательныхПолей()
		.Установить("Вид", Перечисления.ВидыТоваров.Товар)  
		.Установить("Наименование", Наименование)
		;                                       
		
	ТоварНовый = КонструкторТовара.Записать();
	
	Возврат ТоварНовый;
	 
КонецФункции       

Функция СозданиеСправочника(Наименование, ИмяСправочника)
	
	КонструкторСправочника = ЮТест.Данные().КонструкторОбъекта("Справочники." + ИмяСправочника)
		.ФикцияОбязательныхПолей()  
		.Установить("Наименование", Наименование)
		;                                       
		
	ЭлементНовый = КонструкторСправочника.Записать();
	
	Возврат ЭлементНовый;
	 
КонецФункции   

Функция СозданиеРасчетногоСчета(Наименование, ИмяСправочника, Организация)
	
	КонструкторСправочника = ЮТест.Данные().КонструкторОбъекта("Справочники." + ИмяСправочника)
		.ФикцияОбязательныхПолей()  
		.Установить("Наименование", Наименование) 
		.Установить("Владелец", Организация)
		;                                       
		
	ЭлементНовый = КонструкторСправочника.Записать();
	
	Возврат ЭлементНовый;
	 
КонецФункции 

Функция ФиксированныеДанныеДокументов() Экспорт
	
	СтруктураДанных = Новый Структура("Цена, Количество, Сумма, КоличествоРасхода, СуммаРасхода, КоличествоРасходаНегатив, СуммаРасходаНегатив");
	
	СтруктураДанных.Цена = 10;
	СтруктураДанных.Количество = 5;
	СтруктураДанных.Сумма = 50;  
	СтруктураДанных.КоличествоРасхода = 15; 
	СтруктураДанных.КоличествоРасходаНегатив = 14;
	СтруктураДанных.СуммаРасхода = 150; 
	СтруктураДанных.СуммаРасходаНегатив = 140;
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти