#Область СлужебныйПрограммныйИнтерфейс
 
Процедура ИсполняемыеСценарии() Экспорт
     
    ЮТТесты.ДобавитьТестовыйНабор("Тесты документа Приход товара").ВТранзакции()
    	.ДобавитьТест("ПроверкаПроведенияДокументовПриход", "", "Позитив")
		.ДобавитьТест("ПроверкаДвиженийПриходаПоВзаиморасчетам", "", "Позитив")
		.ДобавитьТест("ПроверкаДвиженийПриходаПоТоварнымЗапасам", "", "Позитив")
		;
 
КонецПроцедуры  
	
 
Процедура ПроверкаПроведенияДокументовПриход() Экспорт
 	
 	// Создание данных НСИ     
	СтруктураНСИ = ОМ_ГенерацияТестовыхДанных.СгенерироватьНСИ();
	ТоварНовый = СтруктураНСИ.Товар;
	КонтрагентНовый = СтруктураНСИ.Контрагент;
	СкладНовый = СтруктураНСИ.Склад;
	ВалютаНовая = СтруктураНСИ.Валюта;
	
	СтруктураФиксированныхДанных = ОМ_ГенерацияТестовыхДанных.ФиксированныеДанныеДокументов();
	
	Цена = СтруктураФиксированныхДанных.Цена;
	Количество = СтруктураФиксированныхДанных.Количество;
	Сумма = СтруктураФиксированныхДанных.Сумма;    
	
 	// Создание прихода
	Для Сч = 1 По 3 Цикл
		ПриходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеПрихода(СкладНовый, ТоварНовый, Цена, Сумма, Количество, КонтрагентНовый, ВалютаНовая);  
					
		ЮТест.ОжидаетЧто(ПриходТовара.Проведен)
			.ЭтоИстина("Документ должен быть проведен")
			;                                           
					
	КонецЦикла; 	
 		
КонецПроцедуры   
	
Процедура ПроверкаДвиженийПриходаПоВзаиморасчетам() Экспорт
 	
 	// Создание данных НСИ     
	СтруктураНСИ = ОМ_ГенерацияТестовыхДанных.СгенерироватьНСИ();
	ТоварНовый = СтруктураНСИ.Товар;
	КонтрагентНовый = СтруктураНСИ.Контрагент;
	СкладНовый = СтруктураНСИ.Склад;
	ВалютаНовая = СтруктураНСИ.Валюта; 
	
	СтруктураФиксированныхДанных = ОМ_ГенерацияТестовыхДанных.ФиксированныеДанныеДокументов();
	
	Цена = СтруктураФиксированныхДанных.Цена;
	Количество = СтруктураФиксированныхДанных.Количество;
	Сумма = СтруктураФиксированныхДанных.Сумма;  
	
 	// Создание прихода
	Для Сч = 1 По 3 Цикл
		ПриходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеПрихода(СкладНовый, ТоварНовый, Цена, Сумма, Количество, КонтрагентНовый, ВалютаНовая);  
					 
		ЮТест.ОжидаетЧто(ЮТЗапросы.ДвиженияДокумента(ПриходТовара.Ссылка, "Взаиморасчеты"))
			.НеИмеетДлину(0, "Проверка на неравенство ожидаемому значению 0")
			; 	
					
	КонецЦикла; 		
		 		
КонецПроцедуры   

Процедура ПроверкаДвиженийПриходаПоТоварнымЗапасам() Экспорт
 	
 	// Создание данных НСИ     
	СтруктураНСИ = ОМ_ГенерацияТестовыхДанных.СгенерироватьНСИ();
	ТоварНовый = СтруктураНСИ.Товар;
	КонтрагентНовый = СтруктураНСИ.Контрагент;
	СкладНовый = СтруктураНСИ.Склад;
	ВалютаНовая = СтруктураНСИ.Валюта; 
	
	СтруктураФиксированныхДанных = ОМ_ГенерацияТестовыхДанных.ФиксированныеДанныеДокументов();
	
	Цена = СтруктураФиксированныхДанных.Цена;
	Количество = СтруктураФиксированныхДанных.Количество;
	Сумма = СтруктураФиксированныхДанных.Сумма;  
	
 	// Создание прихода
	Для Сч = 1 По 3 Цикл
		ПриходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеПрихода(СкладНовый, ТоварНовый, Цена, Сумма, Количество, КонтрагентНовый, ВалютаНовая);  
					 
		ЮТест.ОжидаетЧто(ЮТЗапросы.ДвиженияДокумента(ПриходТовара.Ссылка, "ТоварныеЗапасы"))
			.НеИмеетДлину(0, "Проверка на неравенство ожидаемому значению 0")
			; 	
					
	КонецЦикла; 		
		 		
КонецПроцедуры  
			
 
#КонецОбласти  