
&НаСервере
Процедура СписатьПартииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НДСРаздельныйУчетОстатки.Организация КАК Организация,
	               |	НДСРаздельныйУчетОстатки.АналитикаУчетаЗатрат КАК АналитикаУчетаЗатрат,
	               |	НДСРаздельныйУчетОстатки.АналитикаУчетаНДС КАК АналитикаУчетаНДС,
	               |	НДСРаздельныйУчетОстатки.Партия КАК Партия,
	               |	НДСРаздельныйУчетОстатки.СпособУчетаНДС КАК СпособУчетаНДС,
	               |	СУММА(НДСРаздельныйУчетОстатки.КоличествоОстаток) КАК Количество,
	               |	СУММА(НДСРаздельныйУчетОстатки.СуммаБезНДСОстаток) КАК СуммаБезНДС,
	               |	СУММА(НДСРаздельныйУчетОстатки.НДСОстаток) КАК НДС
	               |ИЗ
	               |	РегистрНакопления.НДСРаздельныйУчет.Остатки(&ДатаСписания, Партия В (&МассивПартий)) КАК НДСРаздельныйУчетОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НДСРаздельныйУчетОстатки.АналитикаУчетаЗатрат,
	               |	НДСРаздельныйУчетОстатки.Организация,
	               |	НДСРаздельныйУчетОстатки.Партия,
	               |	НДСРаздельныйУчетОстатки.СпособУчетаНДС,
	               |	НДСРаздельныйУчетОстатки.АналитикаУчетаНДС";
	Запрос.УстановитьПараметр("ДатаСписания", Объект.ДатаСписания); 
	Запрос.УстановитьПараметр("МассивПартий", Объект.Партии.Выгрузить(,"Партия").ВыгрузитьКолонку("Партия"));   
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда 
		Операция = Документы.ОперацияБух.СоздатьДокумент();
		Операция.Дата = Объект.ДатаСписания;
		Операция.Организация = Объект.Организация; 
		Операция.Содержание = "Списание остатков партий НДС";
		Операция.Ответственный = Пользователи.ТекущийПользователь();
		НовРегНакопления = Операция.ТаблицаРегистровНакопления.Добавить();
		НовРегНакопления.Имя = "НДСРаздельныйУчет";
		Операция.Записать();
		
		НабЗап = РегистрыНакопления.НДСРаздельныйУчет.СоздатьНаборЗаписей();
		НабЗап.Отбор.Регистратор.Установить(Операция.Ссылка);
		НабЗап.Прочитать();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Запись = НабЗап.Добавить();
			Запись.Период = Объект.ДатаСписания;
			Запись.Регистратор = Операция.Ссылка;
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Если Выборка.СуммаБезНДС > 0 Тогда  
				Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
			ИначеЕсли Выборка.СуммаБезНДС < 0 Тогда
				Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
				Запись.СуммаБезНДС = -Выборка.СуммаБезНДС;  
				Запись.Количество = -Выборка.Количество;
				Запись.НДС = -Выборка.НДС;
			КонецЕсли;	
		КонецЦикла;	
		
		НабЗап.Записать(Истина);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписатьПартии(Команда)
	СписатьПартииНаСервере();
КонецПроцедуры
