
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ОписаниеЗадания);
	ИдентификаторЗадания = Строка(Параметры.ИдентификаторЗадания);
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ВерсияПлатформы = Лев(СистемнаяИнформация.ВерсияПриложения, 3);
	
	Если ВерсияПлатформы = "8.3"
		Или ВерсияПлатформы = "8.4" Тогда
		
		Попытка
			
			Элементы.ИнформацияОбОшибке.АвтоМаксимальнаяШирина = Ложь;
			
		Исключение
		    
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
