#Область СлужебныйПрограммныйИнтерфейс
 
Процедура ИсполняемыеСценарии() Экспорт
     
    ЮТТесты.ДобавитьТестовыйНабор("Контроль остатков по товарным запасам").ВТранзакции()
    	.ДобавитьТест("ПроверкаВыводаТоварныхЗапасовВНольПозитив", "", "Позитив") 
		.ДобавитьТест("ПроверкаВыводаТоварныхЗапасовВНольНегатив", "", "Негатив")
		;
 
КонецПроцедуры  
	
 
Процедура ПроверкаВыводаТоварныхЗапасовВНольПозитив() Экспорт
 	
 	// Создание данных НСИ     
	СтруктураНСИ = ОМ_ГенерацияТестовыхДанных.СгенерироватьНСИ();
	ТоварНовый = СтруктураНСИ.Товар;
	КонтрагентНовый = СтруктураНСИ.Контрагент;
	СкладНовый = СтруктураНСИ.Склад;
	ВалютаНовая = СтруктураНСИ.Валюта;  
	
	СтруктураФиксированныхДанных = ОМ_ГенерацияТестовыхДанных.ФиксированныеДанныеДокументов();
	
	Цена = СтруктураФиксированныхДанных.Цена;
	Количество = СтруктураФиксированныхДанных.Количество;
	Сумма = СтруктураФиксированныхДанных.Сумма;    
	КоличествоРасхода = СтруктураФиксированныхДанных.КоличествоРасхода;
	СуммаРасхода = СтруктураФиксированныхДанных.СуммаРасхода;
	
 	// Создание прихода
	Для Сч = 1 По 3 Цикл
		ПриходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеПрихода(СкладНовый, ТоварНовый, Цена, Сумма, Количество, КонтрагентНовый, ВалютаНовая);                                         		
	КонецЦикла; 
	
	РасходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеРасхода(СкладНовый, ТоварНовый, Цена, СуммаРасхода, КоличествоРасхода, КонтрагентНовый, ВалютаНовая);
		
	ОстаткиТоваров = ОМ_ГенерацияТестовыхДанных.ПолучитьОстатокТоваров(ТоварНовый, СкладНовый);

	ЮТест.ОжидаетЧто(ОстаткиТоваров) 
		.Равно(0, "Проверка на равенство ожидаемому значению 0")
		;		
 		
КонецПроцедуры  
	
Процедура ПроверкаВыводаТоварныхЗапасовВНольНегатив() Экспорт
 	
 	// Создание данных НСИ     
	СтруктураНСИ = ОМ_ГенерацияТестовыхДанных.СгенерироватьНСИ();
	ТоварНовый = СтруктураНСИ.Товар;
	КонтрагентНовый = СтруктураНСИ.Контрагент;
	СкладНовый = СтруктураНСИ.Склад;
	ВалютаНовая = СтруктураНСИ.Валюта;  
	
	СтруктураФиксированныхДанных = ОМ_ГенерацияТестовыхДанных.ФиксированныеДанныеДокументов();
	
	Цена = СтруктураФиксированныхДанных.Цена;
	Количество = СтруктураФиксированныхДанных.Количество;
	Сумма = СтруктураФиксированныхДанных.Сумма;    
	КоличествоРасхода = СтруктураФиксированныхДанных.КоличествоРасходаНегатив;
	СуммаРасхода = СтруктураФиксированныхДанных.СуммаРасхода;
	
 	// Создание прихода
	Для Сч = 1 По 3 Цикл
		ПриходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеПрихода(СкладНовый, ТоварНовый, Цена, Сумма, Количество, КонтрагентНовый, ВалютаНовая);                                         		
	КонецЦикла; 
	
	РасходТовара = ОМ_ГенерацияТестовыхДанных.СозданиеРасхода(СкладНовый, ТоварНовый, Цена, СуммаРасхода, КоличествоРасхода, КонтрагентНовый, ВалютаНовая);
		
	ОстаткиТоваров = ОМ_ГенерацияТестовыхДанных.ПолучитьОстатокТоваров(ТоварНовый, СкладНовый);

	ЮТест.ОжидаетЧто(ОстаткиТоваров) 
		.НеРавно(0, "Проверка на равенство ожидаемому значению 0")
		;		
 		
КонецПроцедуры  	
 
#КонецОбласти  