
&НаКлиенте
Процедура ЗадержкаПриОбновленииСпискаРегламентныхЗаданийРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗадержкаПриОбновленииСпискаРегламентныхЗаданий = ЗадержкаПриОбновленииСпискаРегламентныхЗаданий + 0.1 * Направление
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ТекущиеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	Результат = Новый Структура("Событие", "НастройкаПараметровОбработки");
	
	НовыеЗначения = Новый Структура("ЗадержкаПриОбновленииСпискаРегламентныхЗаданий");
	ЗаполнитьЗначенияСвойств(НовыеЗначения, ЭтаФорма);
	Результат.Вставить("НовыеЗначения", НовыеЗначения);
	
	ОповеститьОВыборе(Результат);
	
КонецПроцедуры
